# CH.7 Data Cleaning and Preparation

## 1. Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  1.921383       NaN       NaN
1  0.251434       NaN       NaN
2 -1.298690       NaN -0.301425
3  1.551968       NaN  0.715415
4 -0.549596 -0.890129  0.597851
5  1.320467  0.502448  0.380550
6  1.978440  1.121029 -0.156518

In [15]:
df.dropna()

          0         1         2
4 -0.549596 -0.890129  0.597851
5  1.320467  0.502448  0.380550
6  1.978440  1.121029 -0.156518

In [16]:
df.dropna(thresh=2)  # thresh

          0         1         2
2 -1.298690       NaN -0.301425
3  1.551968       NaN  0.715415
4 -0.549596 -0.890129  0.597851
5  1.320467  0.502448  0.380550
6  1.978440  1.121029 -0.156518

In [17]:
# fill na
df.fillna(0)

          0         1         2
0  1.921383  0.000000  0.000000
1  0.251434  0.000000  0.000000
2 -1.298690  0.000000 -0.301425
3  1.551968  0.000000  0.715415
4 -0.549596 -0.890129  0.597851
5  1.320467  0.502448  0.380550
6  1.978440  1.121029 -0.156518

In [18]:
df.fillna({1:0.5,2:0})

          0         1         2
0  1.921383  0.500000  0.000000
1  0.251434  0.500000  0.000000
2 -1.298690  0.500000 -0.301425
3  1.551968  0.500000  0.715415
4 -0.549596 -0.890129  0.597851
5  1.320467  0.502448  0.380550
6  1.978440  1.121029 -0.156518

In [19]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0  1.921383  0.000000  0.000000
1  0.251434  0.000000  0.000000
2 -1.298690  0.000000 -0.301425
3  1.551968  0.000000  0.715415
4 -0.549596 -0.890129  0.597851
5  1.320467  0.502448  0.380550
6  1.978440  1.121029 -0.156518

In [20]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.245245 -0.573306 -1.602420
1  0.309542 -0.318911 -1.097622
2 -0.321869       NaN  0.117568
3 -1.352190       NaN -0.283291
4  0.317358       NaN       NaN
5 -1.743610       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0 -0.245245 -0.573306 -1.602420
1  0.309542 -0.318911 -1.097622
2 -0.321869 -0.318911  0.117568
3 -1.352190 -0.318911 -0.283291
4  0.317358 -0.318911 -0.283291
5 -1.743610 -0.318911 -0.283291

In [22]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.245245 -0.573306 -1.602420
1  0.309542 -0.318911 -1.097622
2 -0.321869 -0.318911  0.117568
3 -1.352190 -0.318911 -0.283291
4  0.317358       NaN -0.283291
5 -1.743610       NaN -0.283291

In [24]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())  # fill NA with mean

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 2. Data Transformation

In [25]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])  # drop duplicates in k1

    k1  k2  v1
0  one   1   0
1  two   1   1

In [29]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 3. Data transformation witn function and mapping

In [30]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef'
                           ,'Bacon','pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [32]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 4. Replacing Values

In [35]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 5. Renaming Axis Indexes

In [39]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                 index=['Ohio','Colorada','New York'],
                 columns=['one','two','three','four'])
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [40]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [41]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [42]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [43]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 6. Discretization and Binning

In [44]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
print(cats.codes)
print(cats.categories)

[0 0 0 1 0 0 2 1 3 2 2 1]
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [46]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [47]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [48]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [49]:
data=np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.35, 0.54], (0.35, 0.54], (0.74, 0.93], (0.54, 0.74], (0.54, 0.74], ..., (0.74, 0.93], (0.35, 0.54], (0.54, 0.74], (0.74, 0.93], (0.35, 0.54]]
Length: 20
Categories (4, interval[float64]): [(0.16, 0.35] < (0.35, 0.54] < (0.54, 0.74] < (0.74, 0.93]]

In [50]:
data=np.random.randn(1000)
cats=pd.qcut(data,4)
cats

[(-3.229, -0.728], (-0.728, 0.0176], (0.687, 2.631], (0.0176, 0.687], (0.0176, 0.687], ..., (0.0176, 0.687], (-0.728, 0.0176], (0.687, 2.631], (0.687, 2.631], (0.0176, 0.687]]
Length: 1000
Categories (4, interval[float64]): [(-3.229, -0.728] < (-0.728, 0.0176] < (0.0176, 0.687] < (0.687, 2.631]]

In [51]:
pd.value_counts(cats)

(0.687, 2.631]      250
(0.0176, 0.687]     250
(-0.728, 0.0176]    250
(-3.229, -0.728]    250
dtype: int64

## 7. Outliers

In [54]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.032519    -0.025892    -0.064431    -0.015209
std       0.970867     0.982023     1.046350     1.001531
min      -3.143396    -3.100155    -3.565884    -3.605647
25%      -0.671730    -0.703094    -0.756234    -0.698488
50%      -0.046262    -0.035736    -0.086321    -0.017648
75%       0.624872     0.669066     0.619719     0.641295
max       3.061009     3.339703     3.765676     3.533045

In [55]:
col = data[2]
col[np.abs(col)>3]

20    -3.147900
149    3.597227
294   -3.565884
342    3.714198
482   -3.368585
693   -3.221410
855    3.765676
Name: 2, dtype: float64

In [56]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
20  -0.468718  0.079939 -3.147900  0.541504
72  -3.143396  1.085858 -1.984403 -2.007700
149 -0.270914 -0.710696  3.597227  0.344885
204  3.061009 -1.310056  0.770208  0.681220
267 -0.101297 -0.483517  0.897848 -3.605647
278  0.896289 -0.210786  2.093705 -3.026052
290 -0.228247  3.339703  0.595133 -0.609166
294  0.839094  1.425450 -3.565884  0.646000
342 -0.348100 -1.462367  3.714198 -0.584304
482 -1.192533  0.305130 -3.368585 -0.730172
693  0.931686 -0.797042 -3.221410 -0.027083
742 -0.881569  1.322549 -0.263364  3.533045
756 -0.404012 -0.887999 -0.834567  3.108450
855  0.119705  0.132714  3.765676  0.432212
911  0.317266 -0.849334  1.992438  3.476185
953  0.451472 -3.100155  0.978342  0.061312

In [57]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.032436    -0.026131    -0.065204    -0.015695
std       0.970225     0.980607     1.035596     0.995817
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.671730    -0.703094    -0.756234    -0.698488
50%      -0.046262    -0.035736    -0.086321    -0.017648
75%       0.624872     0.669066     0.619719     0.641295
max       3.000000     3.000000     3.000000     3.000000

In [58]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

## 8. Permutation and Random Sampling

In [59]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
print(sampler)
df

[1 2 4 0 3]

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [60]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [61]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [62]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

1    7
2   -1
4    4
3    6
1    7
2   -1
3    6
1    7
4    4
3    6
dtype: int64

## 9. Indicator/Dummy Variables

In [63]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [64]:
dummies = pd.get_dummies(df['key'],prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [65]:
mnames=['movie_id','title','generes']
movies=pd.read_table('movies.dat',sep='::',header=None,names=mnames)
movies[:10]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   movie_id                               title                       generes
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [66]:
all_generes = []
for x in movies.generes:
    all_generes.extend(x.split('|'))
    
generes = pd.unique(all_generes)    
generes

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [67]:
zero_matrix = np.zeros((len(movies),len(generes)))
dummies = pd.DataFrame(zero_matrix, columns=generes)
gen = movies.generes[0]

print(gen.split('|'))
print(dummies.columns.get_indexer(gen.split('|')))

['Animation', "Children's", 'Comedy']
[0 1 2]

In [68]:
for i, gen in enumerate(movies.generes):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1
    
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
generes              Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [69]:
np.random.seed(12345)
values=np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [70]:
bins=[0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 10. String Manipulation

In [72]:
val = 'a,b, guido'
print(val.split(','))

pieces = [x.strip()for x in val.split(',')]
print(pieces)

first,second,third = pieces
print(first+'::'+second+'::'+third)

['a', 'b', ' guido']
['a', 'b', 'guido']
a::b::guido

In [74]:
print('[1]', '::'.join(pieces))
print('[2]', 'guido'in val)
print('[3]', val.index(','))
print('[4]', val.find(':'))
print('[5]', val.count(','))
print('[6]', val.replace(',','::'))
print('[7]', val.replace(',',''))

[1] a::b::guido
[2] True
[3] 1
[4] -1
[5] 2
[6] a::b:: guido
[7] ab guido

## 11. Regular Expressions

In [75]:
import re

text = "foo bar\t baz \tqux"
print(re.split('\s+',text))

regex = re.compile('\s+')
print(regex.split(text))
print(regex.findall(text))

['foo', 'bar', 'baz', 'qux']
['foo', 'bar', 'baz', 'qux']
[' ', '\t ', ' \t']

In [77]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0.9._%+-]+@[A-Z0.9.-]+\.[A-Z]{2,4}'

regex=re.compile(pattern, flags=re.IGNORECASE)
print(regex.findall(text))

m = regex.search(text)
print(m)

print(text[m.start():m.end()] )
print(regex.match(text))
print(regex.sub('REDACATED',text))

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']
<re.Match object; span=(5, 20), match='dave@google.com'>
dave@google.com
None
Dave REDACATED
Steve REDACATED
Rob REDACATED
Ryan REDACATED

In [78]:
pattern = r'([A-Z0.9._%+-]+)@([A-Z0.9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern,flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
print(m.groups())

('wesm', 'bright', 'net')

In [79]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [80]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## 12. Vectorized String Functions in pandas

In [81]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com',
     'Rob':'rob@gmail.com','Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [82]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [83]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [84]:
pattern

'([A-Z0.9._%+-]+)@([A-Z0.9.-]+)\\.([A-Z]{2,4})'

In [85]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [86]:
matches = data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [87]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object